package com.example.modam.domain.book;

import jakarta.annotation.PostConstruct;
import org.springframework.stereotype.Component;

import java.util.*;

@Component
public class CategoryMapping {

    private Map<String, String> map = new HashMap<>();
    private final Set<String> impossibleSet = new HashSet<>();

    @PostConstruct
    public void init() {

        // 소설/문학
        map.put("문학", "소설/문학");
        map.put("소설/시/희곡", "소설/문학");
        map.put("문학/소설", "소설/문학");
        map.put("문학이론/비평", "소설/문학");
        map.put("번역문학", "소설/문학");
        map.put("문예지", "소설/문학");
        map.put("문고/신서", "소설/문학");
        map.put("고전", "소설/문학");
        map.put("라이트 노벨", "소설/문학");
        map.put("장르소설", "소설/문학");
        map.put("스페인문학", "소설/문학");
        map.put("희곡/시", "소설/문학");

        // 에세이/전기
        map.put("에세이", "에세이/전기");
        map.put("소설/에세이", "에세이/전기");
        map.put("소설/시/에세이", "에세이/전기");
        map.put("인물/평전", "에세이/전기");
        map.put("전기/자서전", "에세이/전기");

        // 심리/명상
        map.put("심리학/사회학/커뮤니케이션", "심리/명상");
        map.put("명상/점성학", "심리/명상");
        map.put("명상/점술/타로/대체의학", "심리/명상");

        // 인문/사회/정치/법
        map.put("인문학", "인문/사회/정치/법");
        map.put("사회과학", "인문/사회/정치/법");
        map.put("인문/사회", "인문/사회/정치/법");
        map.put("인문/사회/논픽션", "인문/사회/정치/법");
        map.put("인문/사회/역사", "인문/사회/정치/법");
        map.put("법률", "인문/사회/정치/법");
        map.put("법률/정치", "인문/사회/정치/법");
        map.put("사회비평지", "인문/사회/정치/법");
        map.put("교양/문예/인문", "인문/사회/정치/법");
        map.put("문학/어학/인문/사회", "인문/사회/정치/법");

        // 경제/경영
        map.put("경제경영", "경제/경영");
        map.put("경제/경영", "경제/경영");
        map.put("경제/경영/비즈니스", "경제/경영");
        map.put("경제/인문/사회", "경제/경영");
        map.put("시사/경제/교양", "경제/경영");

        // 과학/기술/공학
        map.put("과학", "과학/기술/공학");
        map.put("자연과학", "과학/기술/공학");
        map.put("자연과학/기술", "과학/기술/공학");
        map.put("기술/공업", "과학/기술/공학");
        map.put("과학/기술", "과학/기술/공학");
        map.put("이학/공학/컴퓨터", "과학/기술/공학");
        map.put("기술공학", "과학/기술/공학");
        map.put("컴퓨터/모바일", "과학/기술/공학");


        // 예술/디자인/건축
        map.put("예술", "예술/디자인/건축");
        map.put("예술/디자인", "예술/디자인/건축");
        map.put("미술/디자인/사진", "예술/디자인/건축");
        map.put("건축/디자인", "예술/디자인/건축");
        map.put("아트/건축/디자인", "예술/디자인/건축");
        map.put("예술/대중문화/건축", "예술/디자인/건축");

        // 유아/청소년
        map.put("어린이", "유아/청소년");
        map.put("유아", "유아/청소년");
        map.put("어린이/청소년", "유아/청소년");
        map.put("유아/아동", "유아/청소년");
        map.put("청소년", "유아/청소년");
        map.put("청소년 추천도서", "유아/청소년");
        map.put("좋은부모", "유아/청소년");

        // 라이프스타일/취미
        map.put("자기계발", "라이프스타일/취미");
        map.put("가정/요리/뷰티", "라이프스타일/취미");
        map.put("요리/제과제빵", "라이프스타일/취미");
        map.put("요리/차/음료", "라이프스타일/취미");
        map.put("리빙/가정/주택", "라이프스타일/취미");
        map.put("가정/원예/인테리어", "라이프스타일/취미");
        map.put("여행", "라이프스타일/취미");
        map.put("취미/레저", "라이프스타일/취미");
        map.put("공예/취미/수집", "라이프스타일/취미");
        map.put("패션/미용", "라이프스타일/취미");
        map.put("건강/취미/레저", "라이프스타일/취미");
        map.put("리빙/요리/웨딩", "라이프스타일/취미");
        map.put("남성지", "라이프스타일/취미");
        map.put("여성 패션", "라이프스타일/취미");
        map.put("요리/살림", "라이프스타일/취미");

        // 의학/건강
        map.put("건강", "의학/건강");
        map.put("건강/의학", "의학/건강");
        map.put("의학", "의학/건강");
        map.put("자연/의학", "의학/건강");
        map.put("의학/건강", "의학/건강");
        map.put("대체의학", "의학/건강");

        // 엔터테인먼트/문화
        map.put("예술/대중문화", "엔터테인먼트/문화");
        map.put("대중문화/예술", "엔터테인먼트/문화");
        map.put("영화/음악", "엔터테인먼트/문화");
        map.put("음악/엔터테인먼트/연예", "엔터테인먼트/문화");
        map.put("만화", "엔터테인먼트/문화");
        map.put("게임", "엔터테인먼트/문화");

        // 교육/어학
        map.put("교육/자료", "교육/어학");
        map.put("교육/취업", "교육/어학");
        map.put("어학/교육", "교육/어학");
        map.put("외국어", "교육/어학");
        map.put("외국어학습/교육", "교육/어학");
        map.put("대학/전문교재", "교육/어학");
        map.put("대학교재/전문서적", "교육/어학");
        map.put("시사지", "교육/어학");

        // 역사/종교
        map.put("역사", "역사/종교");
        map.put("종교/역학", "역사/종교");
        map.put("종교/명상/점술", "역사/종교");

        // 여행
        map.put("여행", "여행");
        map.put("금강산", "여행");

        // 로맨스
        map.put("로맨스", "로맨스");
        map.put("하이틴", "로맨스");
        map.put("BL", "로맨스");
        map.put("19+", "로맨스");

        // 가족/관계
        map.put("육아", "가족/관계");
        map.put("좋은부모", "가족/관계");
        map.put("가족/관계", "가족/관계");

        // 판타지/무협/SF
        map.put("판타지/무협", "판타지/무협/SF");
        map.put("SF", "판타지/무협/SF");
        map.put("무협", "판타지/무협/SF");

        // 불가능 카테고리
        Collections.addAll(impossibleSet,
                "ELT/어학/사전", "고등학교참고서", "달력/기타", "달력/다이어리/연감",
                "수험서/자격증", "문구/비도서", "Gift", "가격대별 eBook", "기타", "_ELT/사전",
                "정부간행물", "애니메이션 굿즈", "엔터테인먼트", "지브리 작품전", "다운로드 베스트",
                "참고서/수험서/교재", "중국/아시아", "기타 과월호", "National Geographic 특가",
                "Time USA 특가", "수험/어학교재", "EBS 방송교재", "방송교재",
                "수험서", "사전/기타", "중학교참고서", "중고등참고서", "초등참고서",
                "초등학교참고서", "알라딘오디오북", "오디오북", "전집/중고전집", "CD ~",
                "정기간행물", "브랜드무크지", "교재/수험서", "정기구독", "주간지",
                "기프트북", "일반", "자격/검정시험", "캘린더", "정기구독-영어신문",
                "00(국가) 도서", "한국관련도서", "해외잡지"
        );
    }

    public String mapCategory(String key) {
        return map.get(key.trim());
    }

    public boolean isImpossible(String key) {
        if (key == null) {
            return true;
        }

        String trimmed = key.trim();
        return impossibleSet.stream().anyMatch(trimmed::startsWith);
    }
}